using System;

namespace PrimeNumbers
{
    class Program
    {
        static void Main()
        {
            long n = long.Parse(Console.ReadLine());
            bool[] isNotPrime = new bool[n + 1];//стойностите на елементите чийто индекси са числата от 2 до n
            for (int i = 2; i < Math.Sqrt(isNotPrime.Length); i++)
            {//сложните числа в интервала от 2 до n са произведения от числата от 2 до корен от n
                //няма смисъл да проверяваме с числа по големи от корен от n защото техни квадрати са по големи от n
                //и следователно немогат да бъдат произведения по малки от n
                if (!isNotPrime[i])//всички булеви стойности имат стойност по подразбиране false
                {
                    for (int j = i * i; j <= n; j += i)//намираме всички числа които се делят на i
                    {//започваме от i*i защото произведенията на i с по-малки числа вече са отбелязани
                        isNotPrime[j] = true;//местата където имаме кратни на i се маркират като сложни числа;
                    }
                }
            }
            for (long i = n; i >= 0; i--)//въртим ги отзад напред и търсим първото просто
            {
                if (!isNotPrime[i])
                {
                    Console.WriteLine(i);
                    break;
                }
            }
        }
    }
}
